{"announcement-text-fusion":"Check out my latest interview with Fusion Magazine now!!","bio-experience":"Years of Experience","bio-extended":"For over 15 years, Tracy has been the go-to expert for female voice-overs in all your projects, providing you with a comprehensive, turnkey service for all of your corporate videos, advertisements (TV, radio, or web), and public service announcements.\n\nThis bilingual voice-over narrator is adept in both French and English, offering a cost-effective and time-saving solution.\n\nWhether you're in search of a soothing and composed voice or require a more lighthearted approach, she has the expertise to capture the essence of your projects, elevating them to new heights!","bio-langList":"English, French","bio-language":"Bilingual","bio-projects":"Projects Launched","bio-short":"Bilingual voiceover talent, fluent in both English and French, boasts over 15 years of experience. Specialized in corporate and commercial narration, Interactive Voice Response (IVR), online learning, corporate explainers, Public Service Announcements (PSAs) for government agencies, educational and medical narration, promotional videos for financial institutions, live announcing, Automated Dialogue Replacement (ADR), animation, and more!","catchPhrase":"English, French - Best of both worlds!","cookie-banner":"This website uses cookies to enhance your experience.  By continuing, you agree to our","cookie-company-name":"Voices by Tracy","cookie-consent-info":"By using our website, you agree to our use of this cookie. Since this cookie is essential for providing your chosen language, it cannot be disabled without affecting your experience on the site.","cookie-consent-title":"Your Consent","cookie-contact-string":"If you have any questions about our Cookie Policy, contact us at:","cookie-contact-title":"Contact Us","cookie-manage-info":"You can manage or delete cookies through your browser settings. Note that deleting this cookie may reset your language preference.","cookie-manage-title":"Managing Cookies","cookie-policy":"Cookie policy","cookie-use-data":"Data Stored: Language preference (e.g., \"en\", \"fr\").","cookie-use-info":"We use a single cookie on our website to remember your language preference. This cookie ensures that the website is displayed in your selected language when you visit us.","cookie-use-purpose":"Purpose: To remember your language preference.","cookie-use-title":"Cookie We Use","cookie-use-type":"Type: Functional","Footer-SEO":"Professional voice-over services, where talent meets precision. With a passion for storytelling and a voice that captivates, Tracy brings your projects to life with clarity and emotion. Whether you need a voice for commercials, narration, audio books, animations, or any other project, Tracy-Ann Leith delivers exceptional quality and professionalism.","marketing-message":"I excel in making sure my clients' messages connect deeply with people's core values, reflecting the good they aim to spread into the world.","marketing-slogan":"Driven by Authenticity","title-demo":"Demo Reels","what-cookies-info":"Cookies are small text files stored on your device when you visit a website. They help websites function effectively and enhance your browsing experience.","what-cookies-title":"What are cookies?"}